---
type: Construction
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# Construction

`Autodesk.Revit.DB.Construction` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Id | — | `public string Id { get ; }` |
| Property | Name | — | `public string Name { get ; }` |